

import Foundation

struct StoryNausha{
    var nausha = """
        Батыр Науша был выходец из богатого двенадцатиколенного Малого жуза. Науша рано остался сиротой и долго был беспризорным, пока не подобрал его один бай из рода Алим.
        
        Богатый был этот бай. Одних только лошадей у него было несколько сотен, а другого скота он и счету не знал. Год от года множились стада бая, и одна только беда была у него: время от времени нападали на табуны воры и угоняли скот, особенно лошадей.
        
        Распалилось от гнева на воров сердце маленького батыра, и вот однажды он обращается к своему приемному отцу:
        
        — Отец, разрешите мне пасти лошадей. Помощников не надо — и один управлюсь.
        
        Растрогался бай:
        
        — Сын мой! Разве ты сможешь одолеть опытных воров. Эти злодеи убивают табунщиков — взрослых мужчин. Где уж тебе, ребенку, справиться с ними?!
        
        Но Науша стоял на своем, и бай уступил. Обрадованный первым успехом Науша тайно от отца заказал восьмивершковую камчу из двенадцати ремней и айбалта.
        
        Самый лучший скакун из табуна отца стал конем маленького батыра. Прикрепил мальчик балта между седлом и домброй, взял в руки камчу и, оставив всех табунщиков дома, выехал в ночное.
        
        Не сходя с коня, объезжает маленький батыр табуны, чутко прислушиваясь к темноте. Наступила глубокая ночь. Вдруг забеспокоились лошади — помчался мальчик на шум и видит: три вора делят табун на части. Закричал Науша, но на него даже внимания не обратили. Погнали воры табуны — заплакал мальчик и — за ними:
        
        — Братцы, не угоняйте моих лошадей. Не пользуйтесь тем, что я мал. Лишь смех в ответ. Разгневался маленький батыр, настиг он двух воров, ехавших рядом позади табунов, и сильными ударами камчи сбил их с коней. Третий вор бросился наутек, но мальчик и его настиг и сбил с коня. Собрал он вместе всех лошадей, прихватил коней воров и приехал домой. Вместе с табунами пригнал он и воров, окровавленных, связанных одним арканом. Восторженно встречали аулчане маленького героя. А бай на радостях устроил богатый той. С этого времени ни у бая, ни у его соседей не стали пропадать лошади. Возликовали казахи — появился у них наконец защитник, и среди родов Алимулы и Байулы стали называть храброго мальчика батыром.
        
        Прошло сколько-то лет — подрос Науша и затосковал по родным краям. Просит он отца отпустить его на родину.
        
        Жаль баю расставаться с отважным джигитом, но разве удержишь человека силой? Раз задумал Науша уехать,— рано или поздно уедет. Отпустить его лучше добром.
        
        Согласился бай и решил наделить джигита лошадьми и богатством, чтобы помнил он своего приемного отца. Но ничего не захотел брать Науша. Попросил он только двух верблюдов для переезда, двух коров и двух помощников. Еще он сказал отцу, что хочет взять одного коня из табуна. — Бери самого лучшего скакуна,— сказал бай. Пришли вечером Науша с баем к табунам. Науша и говорит:
        
        — Отец, я лягу спать. Ночью ко мне подойдет конь и обнюхает со всех сторон. Вы запомните этого коня — он будет моим. Лег Науша, а бай остался в седле. Глубокой ночью подошла к Науше трехлетняя серая кобылица, тощая, облезлая, обнюхала юношу со всех сторон и осталась около него до утра. Науша проснулся утром и заявил, что его лошадь пришла к нему.
        
        — Зачем тебе эта паршивая кобылица? Любая другая лучше этой,— недоумевал бай.
        
        — Нет, отец. Эту серую я приметил еще жеребенком. Не хочу другой. Бай приготовил все, что хотел подарить Науше: табун лошадей, сотню овец, двух коров, двух верблюдов и двух помощников. Проводил он сына до Урала и со слезами на глазах благословил в путь.
        
        С родом Алим граничил другой род, где жил батыр Силыбай. Огромного роста, толстый, сильный, Силыбай был непобедим в этих краях. Был он чванлив и горд не в меру. Его раздражали разговоры о каком-то там низкорослом, ничем не примечательным с виду Науше. Люто возненавидел Силыбай своего соперника и готов был померяться с ним силами, чтобы навсегда закрыть рты людям, восхищавшимся храбростью маленького батыра. Науша знал о настроении Силыбая и готовился к встрече с ним. Любил народ своих батыров, гордился ими. И больно было ему знать, что Силыбай не признает своего маленького брата. Собрались однажды аксакалы двух родов и стали думать, как бы подружить им джигитов. И решили они устроить богатый той, пригласить на него батыров и познакомить их. При первой встрече они не посмеют драться, скорее всего подружатся. И вот уже все приготовления к тою закончены. Силыбай приехал раньше Науши и после взаимных приветствий расположился в отведенной для него юрте. Наушу тоже встретили с почетом и привели в юрту Силыбая.
        — Силеке,— обратились аксакалы к батыру,— ваш младший брат Науша пришел отдать вам салем.
        
        Но Силыбай как лежал, вытянувшись во весь свой могучий рост, так и остался лежать, только голову слегка приподнял.
        
        — Казахи часто не могут отличить настоящего батыра от обыкновенного джигита,— брезгливо бросил Силыбай.— А этот и на человека-то едва похож. Есть кому подавать руку. — Эй, Силыбай!— обиделся Науша.— Не слишком ли много берешь на себя? Не быть мне батыром, если будущей весной я не оставлю от тебя мокрого места.— Оскорбленный батыр выбежал из юрты, кликнул своих джигитов, вскочил на коня, и скоро только облако пыли заклубилось вдали. Шли дни за днями. На смену лету пришла зима, после долгой зимы наступила весна.
        
        Силыбай со своими джигитами перешел Урал и разорил род Байулы. Науша был в отлучке и не мог помешать разбойникам. Но когда до батыра дошел слух о постигшей его родичей беде, он собрал своих верных джигитов и помчался вдогонку врагам. Уверенный в своей силе, Силыбай не торопился. Он гордо восседал на белом скакуне, сам одетый во все белое. Сабля его с белым флажком на конце была наготове. «Ишь, какой самоуверенный наглец»,— подумал Науша и приказал своим джигитам быть осторожными, не проливать безрассудно кровь. — Если случится так, что Силыбай одолеет меня, вы, не мешкая, уходите,— наказывал он друзьям.— Если же я сшибу Силыбая, вы бросайтесь на его людей.
        
        Гикнув громко, Науша во весь дух ринулся на Силыбая. Не сбавляя хода, он промчался мимо невозмутимо сидящего на своем коне Силыбая, и враг поскакал следом за ним. Что есть силы скакали лошади батыров, и когда Силыбай стал настигать своего соперника, тот неожиданно резко повернул коня и помчался навстречу противнику. Силыбай не растерялся и принял лобовой бой. Он взмахнул для сокрушительного удара саблей, но Науша ловко сломал рукоять его сабли и вонзил пику в висок противника. Силыбай тяжело рухнул на землю.

        Увидев гибель своего батыра, люди Силыбая бросились наутек. Не стали преследовать их джигиты Науши, они собрали весь скот, богатство и вернулись домой.
        
        ***
        На западной стороне земель рода Байулы были две долины с прекрасным водопоем — озерами Шандыкол и Тамдыкол. И вот возле этих озер на высоком холме поселился дракон. Не стало житья людям. Дракон поедал всех, кто появлялся у озер,— и скот и людей. Задумали люди откочевать из этих мест, но на выручку пришел Науша. Он дал слово батыра избавить народ от страшного чудовища. Взял он саблю и отправился к дракону. Джигиты видели, как он пошел на дракона, взмахнул саблей. Дракон взметнул хвост. Какое-то время не было видно ни батыра, ни дракона. Но вот показался Науша и медленно, еле волоча ноги, направился к джигитам. Все бросились к батыру, подхватили его на руки. Науша был очень бледен. Когда он несколько оправился, то рассказал:
        — Я отрубил голову страшилищу, но он в предсмертных судорогах задел меня хвостом, и я потерял сознание. Когда очнулся, то увидел, что лежу под хвостом дракона. Я с трудом высвободился — такой он большой и тяжелый. Скажите родичам, пусть остаются на местах — дракона уже нет. Народ горячо благодарил своего славного батыра.
        
            Целую
            -your honey
        """
}
